{
  "giant-impact": {
    "title": "PLANETARY: Moon-forming Giant Impact",
    "subtitle": "Understanding the evidence and long-term consequences of the last major accretion of Earth.",
    "content": "Earth’s evolution began 4.5 billion years ago with the Moon-forming impact between Earth and the hypothesized planet Theia. We explore whether continental-scale seismic anomalies are remnants of Theia’s mantle and how plumes from them may have triggered the earliest subduction.",
    "sections": [
      {
        "title": "Research Questions",
        "content": "Where is the missing impactor, Theia? What were the long-term tectonic consequences of the Giant Impact? Why is Earth unique in sustaining plate tectonics?"
      },
      {
        "title": "Methodology",
        "content": "We pioneered the integration of short-timescale (hour-scale) Moon-forming impact simulations with long-timescale (billion-year) mantle convection models, linking them through thermodynamic and seismic constraints. This framework enables us to connect energetic early impacts with the long-term evolution of Earth’s mantle. In addition, we employ fully 3D thermo-elasto-mechanical models to simulate deep mantle structure, plume generation, and plume-driven subduction in a self-consistent way."
      },
      {
        "title": "Key Findings",
        "content": "1. Our canonical Moon-forming giant impact simulations show that the collision would have melted the upper half of Earth’s mantle. 2. Mantle convection models suggest that Theia’s material sank into the lower mantle, forming the Large Low Shear Velocity Provinces (LLSVPs) over 4.5 billion years. 3. Plumes from this reservoir may have triggered the earliest subduction, offering new clues to the Moon’s origin, mantle heterogeneities, and plate tectonics."
      }
    ],
    "publications": [
      {
        "title": "Moon-forming impactor as a source of Earth’s basal mantle anomalies",
        "authors": "Yuan, Q., et al.",
        "journal": "Nature",
        "year": "2023 (Cover Article)",
        "doi": "https://doi.org/10.1038/s41586-023-06589-1"
      },
      {
        "title": "A Giant Impact Origin for the First Subduction on Earth",
        "authors": "Yuan, Q., et al.",
        "journal": "Geophysical Research Letters",
        "year": "2024",
        "doi": "https://doi.org/10.1029/2023GL106723"
      }
    ],
    "images": [
      {
        "src": "https://lh3.googleusercontent.com/d/1TKAQvNrRyKzgFbdsN4WXdX9Ph5dbUNM2",
        "alt": "Numerical model showing LLSVP formation from giant impact",
        "caption": "The cover shows an artist’s impression of the collision between the protoplanet Theia and proto-Earth about 4.5 billion years ago."
      }
    ]
  },
  "ai-geodynamics": {
    "title": "GEOPHYSICS: AI-powered Geodynamics",
    "subtitle": "Toward the Next-generation of Geodynamic Simulation",
    "content": "Neural operators enable geodynamic models to tackle both forward and inverse mantle convection, greatly accelerating simulations while maintaining accuracy. AI also provides a framework to couple geodynamics with thermodynamics, integrating chemical and physical processes into a unified view of Earth’s interior.",
    "sections": [
      {
        "title": "Research Questions",
        "content": "How can neural operators accelerate forward and inverse mantle convection while matching the accuracy of traditional models? How can AI integrate mantle flow with thermodynamic phase changes to build unified models of Earth’s evolution?"
      },
      {
        "title": "Key Findings",
        "content": "We show that the machine learning framework accelerates coupled geodynamic-geochemical modeling by more than 100-fold. The approach paves the way for integrating large-scale 2D and 3D geodynamic and geochemical modeling studies across a broader range of model parameters and at larger spatial and temporal scales than previously possible."
      }
    ],
    "publications": [],
    "images": [
      {
        "src": "https://lh3.googleusercontent.com/d/1NEHOiL6L-TaGmoUptOUht3G6h_5UBEeF",
        "alt": "AI-powered geodynamics",
        "caption": "Bridging mantle flow and thermodynamics efficiently with Neural Network Acceleration"
      }
    ]
  },
  "mars": {
    "title": "PLANETARY: Mars Dynamics",
    "subtitle": "Co-evolition of Martian interior and surface geological features",
    "content": "The internal structure of Mars, including its core, mantle, and crust, holds the key to explaining the planet’s hemispheric dichotomy and its long-term thermal evolution. Insights from marsquakes recorded by NASA’s InSight mission are reshaping our understanding of how these deep processes connect to surface geology and the planet’s divergent evolutionary path compared to Earth.",
    "sections": [
      {
        "title": "Research Objectives",
        "content": "We will conduct numerical simulations of mantle dynamics and earthquake physics, with a particular focus on the recent Marsquake. Our research integrates geodynamic modeling to constrain fault structures and employs seismic cycle simulations to investigate the underlying earthquake processes."
      }
    ],
    "publications": [],
    "images": [
      {
        "src": "https://lh3.googleusercontent.com/d/1auuR9azW431yf2ZjDlSCCGF_qbmJ7hUE",
        "alt": "NASA's Insight Mission",
        "caption": "An artist illustration of the InSight lander on Mars. NASA JPL/Caltech"
      }
    ]
  },
  "llsvp-ulvz": {
    "title": "GEOPHYSICS: Mantle Heterogeneities",
    "subtitle": "Uncovering the Structure and Dynamics of Earth's Mantle Heterogeneities",
    "content": "The structure, morphology, and evolution of deep mantle heterogeneities—particularly the Large Low Shear Velocity Provinces (LLSVPs) and Ultra-Low Velocity Zones (ULVZs)—hold the key to understanding dynamic processes within Earth’s interior. These features influence core–mantle interactions, the geodynamo, the supercontinent cycle, and the triggering of supervolcano eruptions.",
    "sections": [
      {
        "title": "Research Questions",
        "content": "What is the morphology of LLSVPs? What factors control the morphology of LLSVPs? What is the relationship between LLSVPs and ULVZs?"
      }
    ],
    "publications": [
	{ 
        "title": "Instability of the African large low-shear-wave-velocity province due to its low intrinsic density",
        "authors": "Yuan, Q., Li, M.M.",
        "journal": "Nature Geoscience",
        "year": "2022",
        "doi": "https://doi.org/10.1038/s41561-022-00908-3"
          }
	],
    "images": [
      {
        "src": "https://lh3.googleusercontent.com/d/1-YjiE_vE-xQYo7afryWUSLPcChbXtlaH",
        "alt": "The two massive mantle blobs",
        "caption": "The two continental-sized large low-velocity provinces in the lower mantle. Image by Edward Garnero, model from French & Romanowicz, 2014"
      }
    ]
  },
  "tectonic-magmatism": {
    "title": "GEOCHEMISTRY: Tectonic Magmatism",
    "subtitle": "Investigate how plate tectonics drives magma generation and volcanic activity",
    "content": "Tectonic magmatism is a primary window into mantle–crust interactions, recording how melts ascend, react, and reshape the lithosphere. The differentiation of these magmas generates the chemical diversity of Earth’s crust and preserves vital clues about mantle source processes and tectonic environments.",
    "sections": [
      {
        "title": "Main Findings",
        "content": "We couple petrological–thermomechanical simulations with magmatic melting processes to examine lithospheric melting and its surface lithological expression during slab break-off. Our results indicate that in the early Earth, when mantle temperatures were relatively higher, shallow slab break-off could generate significant lithospheric melting and potentially give rise to Proterozoic massif-type anorthosites."
      }
    ],
    "publications": [],
    "images": [
      {
        "src": "https://lh3.googleusercontent.com/d/1N_dij-LT2atfAe7GC4vurAukhtX7XVHq",
        "alt": "Slad breakoff",
        "caption": "Lithospheric melting induced by a slab break-off after continental collision."
      }
    ]
  },
  "magmatic-process": {
    "title": "PETROLOGY: Ore-forming Magma Chamber Processes",
    "subtitle": "Investigate how magma accumulates, evolves, and drives mineralization and volcanic activity",
    "content": "Understanding their origin, the physical and chemical processes within magma chambers, and their tectonic context not only advances fundamental igneous petrology but also informs the exploration of critical mineral resources essential for modern technology and the global energy transition.",
    "sections": [
      {
        "title": "Key Findings",
        "content": "The Bushveld UUMZ grew through repeated replenishment and emplacement of plagioclase- and crystal-laden magmas from deeper chambers, producing cyclic reversals in mineral compositions and linked anorthosite or leucogabbro layers. Subsequent hybrid melt formation, immiscibility of Fe- and Si-rich melts, and slow cooling in a shallow chamber controlled the evolution of magnetite layers and systematic compositional trends within each cycle."
      }
    ],
    "publications": [],
    "images": [
      {
        "src": "https://lh3.googleusercontent.com/d/1XWq5ii6SwVnIpzLyrpeUNBq1qa8WeUEC",
        "alt": "Bushveld thin section",
        "caption": "Representative thin section of a plagioclase-rich sample from the Bushveld layered intrusion"
      }
    ]
  }
}
