{
  "giant-impact": {
    "title": "PLANETARY: Moon-forming Giant Impact",
    "subtitle": "Understanding the evidence and long-term consequences of the last major accretion of Earth.",
    "content": "Earth’s evolution began 4.5 billion years ago with the Moon-forming impact between Earth and the hypothesized planet Theia. We explore whether continental-scale seismic anomalies are remnants of Theia’s mantle and how plumes from them may have triggered the earliest subduction.",
    "sections": [
      {
        "title": "Research Questions",
        "content": "Where is the missing impactor, Theia? What were the long-term tectonic consequences of the Giant Impact? Why is Earth unique in sustaining plate tectonics?"
      },
      {
        "title": "Methodology",
        "content": "We pioneered the integration of short-timescale (hour-scale) Moon-forming impact simulations with long-timescale (billion-year) mantle convection models, linking them through thermodynamic and seismic constraints. This framework enables us to connect energetic early impacts with the long-term evolution of Earth’s mantle. In addition, we employ fully 3D thermo-elasto-mechanical models to simulate deep mantle structure, plume generation, and plume-driven subduction in a self-consistent way."
      },
      {
        "title": "Key Findings",
        "content": "1. Our canonical Moon-forming giant impact simulations show that the collision would have melted the upper half of Earth’s mantle. 2. Mantle convection models suggest that Theia’s material sank into the lower mantle, forming the Large Low Shear Velocity Provinces (LLSVPs) over 4.5 billion years. 3. Plumes from this reservoir may have triggered the earliest subduction, offering new clues to the Moon’s origin, mantle heterogeneities, and plate tectonics."
      }
    ],
    "publications": [
      {
        "title": "Moon-forming impactor as a source of Earth’s basal mantle anomalies",
        "authors": "Yuan, Q., et al.",
        "journal": "Nature",
        "year": "2023 (Cover Article)",
        "doi": "https://doi.org/10.1038/s41586-023-06589-1"
      }
    ],
    "images": [
      {
        "src": "https://images.unsplash.com/photo-1446776653964-20c1d3a81b06?ixlib=rb-4.0.3&auto=format&fit=crop&w=1200&q=80",
        "alt": "Numerical model showing LLSVP formation from giant impact",
        "caption": "The cover shows an artist’s impression of the collision between the protoplanet Theia and proto-Earth about 4.5 billion years ago."
      }
    ]
  },
  "ai-thermodynamics": {
    "title": "GEOPHYSICS: AI-powered Geodynamics",
    "subtitle": "Mechanisms and Processes of Subduction Zone Formation",
    "content": "Bridging mantle flow and thermodynamics efficiently remains a major challenge. To address this, we introduce a flexible, general, and efficient framework that integrates geodynamics with thermodynamics using machine learning.",
    "sections": [
      {
        "title": "Research Focus",
        "content": "We study the conditions and processes that lead to the formation of new subduction zones, combining field observations, laboratory experiments, and numerical modeling to understand this fundamental tectonic process."
      },
      {
        "title": "Analytical Approaches",
        "content": "Our research employs multi-scale modeling approaches, from local stress field analysis to global geodynamic simulations, to understand the initiation and early evolution of subduction systems."
      }
    ],
    "publications": [],
    "images": [
      {
        "src": "https://images.unsplash.com/photo-1614728263952-84ea256f9679?ixlib=rb-4.0.3&auto=format&fit=crop&w=1200&q=80",
        "alt": "Mars surface showing geological formations",
        "caption": "Geological processes on Mars provide insights into subduction initiation mechanisms"
      }
    ]
  },
  "Mars": {
    "title": "PLANETARY: Mars Dynamics",
    "subtitle": "Co-evolition of Martian interior and surface geological features",
    "content": "The internal structure of Mars, including its core, mantle, and crust, holds the key to explaining the planet’s hemispheric dichotomy and its long-term thermal evolution. Insights from marsquakes recorded by NASA’s InSight mission are reshaping our understanding of how these deep processes connect to surface geology and the planet’s divergent evolutionary path compared to Earth.",
    "sections": [
      {
        "title": "Morphological Analysis",
        "content": "We analyze seismic tomography data to characterize the three-dimensional structure and morphology of LLSVPs, identifying key differences between the African and Pacific provinces."
      }
    ],
    "publications": [],
    "images": [
      {
        "src": "https://images.unsplash.com/photo-1502134249126-9f3755a50d78?ixlib=rb-4.0.3&auto=format&fit=crop&w=1200&q=80",
        "alt": "Jupiter with its distinctive atmospheric bands",
        "caption": "Planetary structures analogous to LLSVP morphological variations"
      }
    ]
  },
  "llsvp-ulvz": {
    "title": "GEOPHYSICS: Mantle Heterogeneities",
    "subtitle": "Dynamics of Large Low Shear Velocity Provinces and Ultra-low Velocity Provinces",
    "content": "The structure, morphology, and evolution of deep mantle heterogeneities hold the key to understanding the dynamic processes operating in Earth’s interior, processes that influence the geodynamo, the supercontinent cycle, and supervolcano eruptions",
    "sections": [
      {
        "title": "Analytical Techniques",
        "content": "We employ high-precision mass spectrometry to measure lithium isotope ratios in humite group minerals, developing new analytical protocols for small sample sizes."
      }
    ],
    "publications": [],
    "images": [
      {
        "src": "https://images.unsplash.com/photo-1614313913007-2b4ae8ce32d6?ixlib=rb-4.0.3&auto=format&fit=crop&w=1200&q=80",
        "alt": "Earth from space showing atmospheric layers",
        "caption": "Atmospheric processes analogous to lithium isotope fractionation"
      }
    ]
  },
  "tectonic-magmatism": {
    "title": "GEOCHEMISTRY: Tectonic Magmatism",
    "subtitle": "Magmatic Processes in the Bushveld Complex",
    "content": "Tectonic magmatism is a primary window into mantle–crust interactions, recording how melts ascend, react, and reshape the lithosphere. The differentiation of these magmas generates the chemical diversity of Earth’s crust and preserves vital clues about mantle source processes and tectonic environments.",
    "sections": [
      {
        "title": "Petrological Analysis",
        "content": "We study the textural and chemical characteristics of Bushveld rocks to understand the processes of mush emplacement and differentiation in large magmatic systems."
      }
    ],
    "publications": [],
    "images": [
      {
        "src": "https://images.unsplash.com/photo-1502134249126-9f3755a50d78?ixlib=rb-4.0.3&auto=format&fit=crop&w=1200&q=80",
        "alt": "Jupiter's Great Red Spot",
        "caption": "Complex fluid dynamics similar to magmatic mush emplacement processes"
      }
    ]
  },
  "magmatic_process": {
    "title": "PETROLOGY: Ore-forming Magma Chamber Processes",
    "subtitle": "Temporal Constraints from Zircon Corona Textures",
    "content": "Understanding their origin, the physical and chemical processes within magma chambers, and their tectonic context not only advances fundamental igneous petrology but also informs the exploration of critical mineral resources essential for modern technology and the global energy transition.",
    "sections": [
      {
        "title": "Geochronological Methods",
        "content": "We use high-resolution ion microprobe techniques to date zircon coronas, providing precise temporal constraints on the formation and evolution of Fe-Ti oxide-bearing assemblages."
      },
      {
        "title": "Textural Analysis",
        "content": "Detailed petrographic and electron microscopy studies reveal the complex relationships between zircon coronas and their host Fe-Ti oxides, informing our geochronological interpretations."
      }
    ],
    "publications": [],
    "images": [
      {
        "src": "https://images.unsplash.com/photo-1614728263952-84ea256f9679?ixlib=rb-4.0.3&auto=format&fit=crop&w=1200&q=80",
        "alt": "Mars surface with mineral formations",
        "caption": "Mineral textures and formations analogous to zircon corona structures"
      }
    ]
  }
}
